#2維列表與巢狀迴圈
#行--水平的列表  列--垂直的列表
#二維列表   4行*3列
nums=[
    [0,1,2],
    [3,4,5],
    [6,7,8],
    [9,10,11]   
]
print(nums[1][2])#第2行第3列
print(nums[3][0])#第4行第1列

for row in nums:#放入4行  
    print(row) 
    
for row in nums:#每行放入row
     for col in row:#每行的值取出放入列
         print(col)
         
         
#三維列表   4行*1階*3列      (先曲紫色再取藍色再取綠色)
n=[
    [[0,1,2]],
    [[3,4,5]],
    [[6,7,8]],
    [[9,10,11]]   
]         
         
print(n[0][0][0])# 
print(n[1][0][0])# 
print(n[0][0][1])# 